Exercício 1 - Modelagem e normalização de bancos de dados relacionais

Modelagem conceitual

<p align="center">
  <img 
    src   = "./modelo-conceitual-2.jpg" 
    style = "
      border: 0px solid rgba(0, 0, 0, 0.01);
      width: 100%;
      height: 100%;
    "
  />
</p>

Atributo multivalorado: telefones_clientes, da tabela Cliente. Está apontado no esquema acima.

Modelagem lógica

<p align="center">
  <img 
    src   = "./modelo-logico-2.jpg" 
    style = "
      border: 0px solid rgba(0, 0, 0, 0.01);
      width: 100%;
      height: 100%;
    "
  />
</p>

Atributos-chave estão marcados com PK e as chaves estrangeiras com FK. O atributo multivalorado foi separado em duas colunas. A decisão por separar em duas colunas foi tomada com base na quantidade média de telefones de uma pessoa (geralmente um fixo e um celular).

Exercício 2 - Consultas SQL simples e complexas em um banco de dados MySQL

<font size="6">Importante!</font> Estou usando estrutura <font size="6">MySQL</font> no meu projeto!

In [ ]:
CREATE SCHEMA AdaBancoProva;

USE AdaBancoProva;

CREATE TABLE produto (
    id_produto INTEGER PRIMARY KEY AUTO_INCREMENT,
    nome_produto VARCHAR(100) NOT NULL,
    preco_produto DECIMAL(10, 2) NOT NULL
);

CREATE TABLE categoria (
    id_categoria INTEGER PRIMARY KEY AUTO_INCREMENT,
    nome_categoria VARCHAR(100) NOT NULL
);

INSERT INTO produto VALUES
(null, 'air frier', 200.00),
(null, 'iPhone', 5000.00),
(null, 'caneca', 10.00),
(null, 'garrafa termica', 40.00),
(null, 'nespresso', 500.00);

SELECT * FROM produto;

INSERT INTO categoria VALUES
(null, 'eletrodomestico'),
(null, 'celular'),
(null, 'casa'),
(null, 'cozinha'),
(null, 'tecnologia');

SELECT * FROM categoria;

CREATE TABLE produtos_categorias (
    produto_id INTEGER REFERENCES produto(id_produto),
    categoria_id INTEGER REFERENCES categoria(id_categoria),
    PRIMARY KEY (produto_id, categoria_id)
);

INSERT INTO produtos_categorias VALUES
(1,1),
(1,3),
(1,4),
(2,2),
(2,5),
(3,3),
(3,4),
(4,3),
(4,4),
(5,1),
(5,3),
(5,4);

SELECT * FROM produtos_categorias;

3) Liste os nomes de todos os produtos que custam mais de 100 reais, ordenando-os primeiramente pelo preço e em segundo lugar pelo nome. Use alias para mostrar o nome da coluna nome como "Produto" e da coluna preco como "Valor". A resposta da consulta não deve mostrar outras colunas de dados.

In [ ]:
SELECT nome_produto AS Produto, preco_produto AS Valor FROM produto 
WHERE preco_produto > 100.00
ORDER BY preco_produto, nome_produto;

4) Liste todos os ids e preços de produtos cujo preço seja maior do que a média de todos os preços encontrados na tabela "produtos".

In [ ]:
SELECT id_produto, preco_produto FROM produto 
WHERE preco_produto > (SELECT AVG(preco_produto) AS MediaValor FROM produto);

5) Para cada categoria, mostre o preço médio do conjunto de produtos a ela associados. Caso uma categoria não tenha nenhum produto a ela associada, esta categoria não deve aparecer no resultado final. A consulta deve estar ordenada pelos nomes das categorias.

In [ ]:
SELECT c.nome_categoria AS NomeCategoria, AVG(p.preco_produto) AS MediaPreco
FROM categoria c
LEFT JOIN produtos_categorias pc ON c.id_categoria = pc.categoria_id
LEFT JOIN produto p ON pc.produto_id = p.id_produto
GROUP BY c.nome_categoria;

Exercício 3 - Inserções, alterações e remoções de objetos e dados em um banco de dados MySQL

<font size="6">Importante!</font> Estou usando estrutura <font size="6">MySQL</font> no meu projeto!

6) Com o objetivo de demonstrar o seu conhecimento através de um exemplo contextualizado com o dia-a-dia da escola, utilize os comandos do subgrupo de funções DDL para construir o banco de dados simples abaixo, que representa um relacionamento do tipo 1,n entre as entidades "aluno" e "turma":

In [ ]:
CREATE TABLE turma (
    id_turma INT PRIMARY KEY AUTO_INCREMENT,
    codigo_turma VARCHAR(10),
    nome_turma VARCHAR(20)
);

CREATE TABLE aluno (
    id_aluno INT PRIMARY KEY AUTO_INCREMENT,
    nome_aluno VARCHAR(130),
    aluno_alocado BOOLEAN,
    id_turma INT,
    FOREIGN KEY (id_turma) REFERENCES turma(id_turma)
);

a) Inserir pelo menos duas turmas diferentes na tabela de turma;

In [ ]:
INSERT INTO turma (codigo_turma, nome_turma) VALUES
    ('T001', 'Matemática'),
    ('T002', 'História'),
    ('T003', 'Ciências');
    
SELECT * FROM turma;

b) Inserir pelo menos 1 aluno alocado em cada uma destas turmas na tabela aluno (todos com NULL na coluna aluno_alocado);

In [ ]:
INSERT INTO aluno (nome_aluno, aluno_alocado, id_turma) VALUES
    ('João', NULL, 1),
    ('Maria', NULL, 2),
    ('Pedro', NULL, 1),
    ('Ana', NULL, 3); 
    
SELECT * FROM aluno;

c) Inserir pelo menos 2 alunos não alocados em nenhuma turma na tabela aluno (todos com NULL na coluna aluno_alocado);

In [ ]:
INSERT INTO aluno (nome_aluno, aluno_alocado, id_turma) VALUES
    ('José', NULL, NULL),
    ('Mateus', NULL, NULL); 

    SELECT * FROM aluno;

d) Atualizar a coluna aluno_alocado da tabela aluno, de modo que os alunos associados a uma disciplina recebam o valor True e alunos não associdos a nenhuma disciplina recebam o falor False para esta coluna.

In [ ]:
UPDATE aluno
SET aluno_alocado = CASE
    WHEN id_turma IS NOT NULL THEN TRUE
    ELSE FALSE
END
WHERE id_aluno > 0;

--precisei colocar uma clausula de WHERE porque meu MySQL tem um safe updating mode ativado que não permite update sem where